/*выберите любой алгоритм кэширования из перечисленных ниже
- ARC (adaptice raplacement cashe)
- 2Q (алгоритм двух очередей, дальнейшее развитие LRU)
- LFU (вытеснение наименее часто используемого
- LIRS (low-inference recency set)

Входные и выходные данные
- На stdin размер кэша и кол-во элементов, потом сами элементы (целыми числами)
пример: вход 2 6 1 2 1 2 1 2 выход 4

Обязательно добавьте сравнение с идеальным кэшированием*/

/*как преуспеть в домашних работах
- организация кода
-- убедитесь, что вы умеете работать с системой контроля версии, что ваши программы разбиты на переиспользуемые модули, что модули логично названы

-Система сборки
-- Лучше всего если вы освоите cmake, но любая другая система тоже подойдет
-- проверьте сборку под windows и под linux

- Тестирование и обработка ошибок ввода
-- не бойтесь писать и даже генерировать end-to-end тесты, вход, выход

- Качество кода
-- убедитесьЮ что ваши методы достаточно короткие, что их имена логичны, что на модифицирующих методах не забыт const
*/
